app/graphql/mutations/create_rep.rb

SELECT "gitusers".* FROM "gitusers" WHERE "gitusers"."log" = ? LIMIT ?  [["log", "Hauxenbro"], ["LIMIT", 1]]
INSERT INTO "gitreps" ("name", "gituser_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "AvitoBackendTraineeTestCase"], ["gituser_id", 1], ["created_at", "2022-07-19 12:47:20.194978"], ["updated_at", "2022-07-19 12:47:20.194978"]]
---
    def resolve(log:, name:)
      user = Gituser.find_by_log(log)
      repository = user.gitreps.new(name: name)
      if repository.save