app/graphql/mutations/create_gituser.rb

INSERT INTO "gitusers" ("log", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["log", "Hauxenbro"], ["name", "# No Name"], ["created_at", "2022-07-19 12:47:19.905978"], ["updated_at", "2022-07-19 12:47:19.905978"]]
---
    def resolve(log:, name:)
      gituser = Gituser.new(log: log, name: name)
      if gituser.save