app/graphql/mutations/update_gituser.rb

    def resolve(id:, attributes:)
      gituser = Gituser.find(id)
      return { gituser: gituser } if gituser.update(attributes.to_h)
---
SELECT "gitusers".* FROM "gitusers" WHERE "gitusers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "gitusers" SET "log" = ?, "name" = ?, "updated_at" = ? WHERE "gitusers"."id" = ?  [["log", "Ivan1421"], ["name", "Vanya228"], ["updated_at", "2022-07-17 14:23:23.328231"], ["id", 2]]