app/graphql/types/query_type.rb

SELECT "gitusers".* FROM "gitusers" WHERE "gitusers"."log" = ? LIMIT ?  [["log", "VanyaBoss"], ["LIMIT", 1]]
---
    def gitrepsName(log:)
      user = Gituser.find_by_log(log)

SELECT "gitusers".* FROM "gitusers" WHERE "gitusers"."log" = ? LIMIT ?  [["log", "Hauxenbro"], ["LIMIT", 1]]
---
    def getuserName(log:)
      Gituser.where(log: log)