app/controllers/gitusers_controller.rb

  def create

    # Получаем логин из формы
    $log = gituser_params["log"]

    # Получаем из гита имя
    url = URI("https://api.github.com/users/#{$log}")
    response = Net::HTTP.get(url)
    $name = JSON.parse(response)["name"] ? JSON.parse(response)["name"] : "# No Name"

    # параметры для запросов
    url_gr = URI("https://testcasegitreps.herokuapp.com//graphql")
    http = Net::HTTP.new(url_gr.host, url_gr.port);
    request = Net::HTTP::Post.new(url_gr)
    request["Content-Type"] = "application/json"

    if Gituser.exists?(:log => $log)
      # Если имя изменилось, то перезаписываем его.
      request.body = "{\"query\":\"{\\r\\n  getuserName(log:\\\"#{$log}\\\")\\r\\n  {\\r\\n    log\\r\\n    name\\r\\n  }\\r\\n}\",\"variables\":{}}"
      response = http.request(request)
      name_ch = JSON.parse(response.read_body)["data"]["getuserName"][0]["name"]
      id = Gituser.find_by_log($log).id
      Gitrep.where("gituser": id).delete_all
---
SELECT "gitusers".* FROM "gitusers" WHERE "gitusers"."log" = ? LIMIT ?  [["log", "Hauxenbro"], ["LIMIT", 1]]
SELECT 1 AS one FROM "gitusers" WHERE "gitusers"."log" = ? LIMIT ?  [["log", "Hauxenbro"], ["LIMIT", 1]]
SELECT "gitusers".* FROM "gitusers" WHERE "gitusers"."log" = ? LIMIT ?  [["log", "vasyaasasdasdasd"], ["LIMIT", 1]]
DELETE FROM "gitreps" WHERE "gitreps"."gituser_id" = ?  [["gituser_id", 10]]
DELETE FROM "gitusers" WHERE (log = Hauxenbro)

    end

    if not response.nil?
      @user = Gituser.find_by_log($log)
---
SELECT "gitusers".* FROM "gitusers" WHERE "gitusers"."log" = ? LIMIT ?  [["log", "Hauxenbro"], ["LIMIT", 1]]